/*
 * Використовуючи Visual Studio, створіть проект за шаблоном Console Application. 
 * Створіть колекцію MyDictionary. Реалізуйте у найпростішому наближенні можливість 
 * використання її екземпляра аналогічно екземпляру класу Dictionary. 
 * Мінімально необхідний інтерфейс взаємодії з екземпляром повинен 
 * включати метод додавання елемента, індексатор для отримання значення елемента 
 * за вказаним індексом і властивість тільки для читання для отримання загальної 
 * кількості елементів. Реалізуйте можливість перебору елементів колекції у циклі наперед.
 */

namespace MyDictionary
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Delay.
            Console.WriteLine("\nPress any key to continue...");
            Console.ReadKey();
        }
    }
}
