/*
 * Використовуючи Visual Studio, створіть проект за шаблоном Console Application. 
 * Уявіть, що ви пишете програму для Автостанції і вам необхідно створити просту колекцію автомобілів 
 * з такими даними: марка автомобіля, модель, рік випуску, колір. 
 * А також другу колекцію з моделлю автомобіля, ім'ям покупця та його номером телефону. 
 * Використовуючи найпростіший запит LINQ, виведіть на екран інформацію про покупця одного з автомобілів 
 * і повну характеристику придбаної ним моделі. 
 */

namespace Autostation
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
